//
// Created by kates on 09.03.2021.
//

#ifndef SPELLS2_CPP_ARMY_H
#define SPELLS2_CPP_ARMY_H
#include <iostream>
using namespace std;

class Army {
private:

    string Race;
    string Name;
    string Stats;

public:
    string army [33][3]={
            {"Драконы","Белокрылый ледяной дракон","70_280_100_8000"},
            {"Драконы", "Невидимый коготь","120_220_160_25000"},
            {"Драконы","Тёмный лорд", "70_100_70_5000"},
            {"Люди","Лучники","50_80_10_800"},
            {"Люди","Маги","100_100_10_1500"},
            {"Люди","Воины","30_50_20_700"},
            {"Машины","Катапульта","75_30_0_2000"},
            {"Машины","Турель-лягушка",},
            {"Машины",},
            {"Тролли",},
            {"Тролли",},
            {"Тролли",},
            {"Ангелы",},
            {"Ангелы",},
            {"Ангелы",},
            {"Нежить",},
            {"Нежить",},
            {"Нежить",},
            {"Элементали",},
            {"Элементали",},
            {"Элементали",},
            {"Огры",},
            {"Огры",},
            {"Огры",},
            {"Преисподня",},
            {"Преисподня",},
            {"Преисподня",},
            {"Существа",},
            {"Существа",},
            {"Существа",},
            {"Гачисты",},
            {"Гачисты",},
            {"Гачисты",},
    }
    Arms(){


    }
};


#endif //SPELLS2_CPP_ARMY_H
