//
// Created by kates on 09.03.2021.
//

#ifndef SPELLS2_CPP_ARMY_H
#define SPELLS2_CPP_ARMY_H
#include <iostream>
using namespace std;

class Army {
private:

    string Race;
    string Name;
    string Stats;

public:
    string army [33][3]={
            {"Драконы","Белокрылый ледяной дракон","70_280_20_8000"},
            {"Драконы", "Невидимый коготь","120_220_10_25000"},
            {"Драконы",""},
            {"Люди",},
            {"Люди",},
            {"Люди",},
            {"Машины",},
            {"Машины",},
            {"Машины",},
            {"Тролли",},
            {"Тролли",},
            {"Тролли",},
            {"Ангелы",},
            {"Ангелы",},
            {"Ангелы",},
            {"Нежить",},
            {"Нежить",},
            {"Нежить",},
            {"Элементали",},
            {"Элементали",},
            {"Элементали",},
            {"Огры",},
            {"Огры",},
            {"Огры",},
            {"Преисподня",},
            {"Преисподня",},
            {"Преисподня",},
            {"Существа",},
            {"Существа",},
            {"Существа",},
            {"Гачисты",},
            {"Гачисты",},
            {"Гачисты",},
    }
    Arms(){


    }
};


#endif //SPELLS2_CPP_ARMY_H
